app/controllers/rates_controller.rb

SELECT "rates".* FROM "rates"
---
  def index
    @rates = Rate.all

SELECT  "rates".* FROM "rates" WHERE "rates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_rate
      @rate = Rate.find(params[:id])